# Concatenating, Merging and Joining DataFrames in Pandas

1. Concat
2. Append
3. Merge
4. Join

### Let's undestand concatenating

In [1]:
# Let's create two dummy data frames to understand
import pandas as pd

df1 = pd.DataFrame({'item': ['A', 'B', 'C', 'D'],
                     'value': [1, 2, 3, 5]})

df2 = pd.DataFrame({'item': ['E', 'F', 'G', 'H'],
                    'value': [5, 6, 7, 8]})

print(df1)
print(df2)

  item  value
0    A      1
1    B      2
2    C      3
3    D      5
  item  value
0    E      5
1    F      6
2    G      7
3    H      8

In [2]:
df1

  item  value
0    A      1
1    B      2
2    C      3
3    D      5

In [3]:
# Let's stack them vertically by using pd.concat

pd.concat([df1, df2])

  item  value
0    A      1
1    B      2
2    C      3
3    D      5
0    E      5
1    F      6
2    G      7
3    H      8

In [4]:
# What if they had different column names

df1 = pd.DataFrame({'item': ['A', 'B', 'C', 'D'],
                     'value': [1, 2, 3, 5]})

df2 = pd.DataFrame({'item': ['E', 'F', 'G', 'H'],
                    'quanity': [2, 2, 1, 5]})

pd.concat([df1, df2])

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:8: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  item  quanity  value
0    A      NaN    1.0
1    B      NaN    2.0
2    C      NaN    3.0
3    D      NaN    5.0
0    E      2.0    NaN
1    F      2.0    NaN
2    G      1.0    NaN
3    H      5.0    NaN

In [1]:
import pandas as pd

In [6]:
# What if they had duplicates in items

df1 = pd.DataFrame({'item': ['A', 'B', 'C', 'D'],
                     'value': [1, 2, 3, 5]})

df2 = pd.DataFrame({'item': ['D', 'F', 'G', 'H'],
                    'quanity': [2, 2, 1, 5]})

df3 = pd.concat([df1, df2]).reset_index()

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:9: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  if __name__ == '__main__':

In [7]:
df3

   index item  quanity  value
0      0    A      NaN    1.0
1      1    B      NaN    2.0
2      2    C      NaN    3.0
3      3    D      NaN    5.0
4      0    D      2.0    NaN
5      1    F      2.0    NaN
6      2    G      1.0    NaN
7      3    H      5.0    NaN

In [10]:
df3.iloc[0]

index        0
item         A
quanity    NaN
value        1
Name: 0, dtype: object

In [12]:
df3["item"]

0    A
1    B
2    C
3    D
4    D
5    F
6    G
7    H
Name: item, dtype: object

In [13]:
df3["index"]==1

0    False
1     True
2    False
3    False
4    False
5     True
6    False
7    False
Name: index, dtype: bool

In [3]:
df1

  item  value
0    A      1
1    B      2
2    C      3
3    D      5

In [4]:
df2

  item  quanity
0    D        2
1    F        2
2    G        1
3    H        5

In [14]:
df4 = pd.concat([df1, df2])

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [15]:
df4

  item  quanity  value
0    A      NaN    1.0
1    B      NaN    2.0
2    C      NaN    3.0
3    D      NaN    5.0
0    D      2.0    NaN
1    F      2.0    NaN
2    G      1.0    NaN
3    H      5.0    NaN

In [17]:
df4.iloc[0]

item         A
quanity    NaN
value        1
Name: 0, dtype: object

In [8]:
# We can use axis = 1 to stack horizontally 

pd.concat([df1, df2], axis = 1)

  item  value item  quanity
0    A      1    D        2
1    B      2    F        2
2    C      3    G        1
3    D      5    H        5

#### Vertical Concat

![alt text](https://pandas.pydata.org/pandas-docs/stable/_images/merging_concat_basic.png)

#### Horizontal Conat 

![alt text](https://pandas.pydata.org/pandas-docs/stable/_images/merging_concat_axis1.png)

# Similarly we can use Append to add multiple dataFrames onto another

In [19]:
df1 = pd.DataFrame({'item': ['A', 'B', 'C', 'D'],
                     'value': [1, 2, 3, 5]})

df2 = pd.DataFrame({'item': ['D', 'F', 'G', 'H'],
                    'quanity': [2, 2, 1, 5]})

df3 = pd.DataFrame({'item': ['I', 'J', 'K', 'L'],
                    'quanity': [3, 4, 7, 25]})

df1.append([df2, df3],ignore_index = True)

C:\Anaconda3\lib\site-packages\pandas\core\frame.py:6692: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

   item  quanity  value
0     A      NaN    1.0
1     B      NaN    2.0
2     C      NaN    3.0
3     D      NaN    5.0
4     D      2.0    NaN
5     F      2.0    NaN
6     G      1.0    NaN
7     H      5.0    NaN
8     I      3.0    NaN
9     J      4.0    NaN
10    K      7.0    NaN
11    L     25.0    NaN

In [20]:
df1

  item  value
0    A      1
1    B      2
2    C      3
3    D      5

# Pandas merge

Pandas has full-featured, high performance in-memory join operations idiomatically very similar to relational databases like SQL:

- **one-to-one joins:** for example when joining two DataFrame objects on their indexes (which must contain unique values).
- **many-to-one joins:** for example when joining an index (unique) to one or more columns in a different DataFrame.
- **many-to-many** joins: joining columns on columns.

![alt text](https://i.stack.imgur.com/hMKKt.jpg)

In [12]:
dfA = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})

dfB = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                       'C': ['C0', 'C1', 'C2', 'C3'],
                       'D': ['D0', 'D1', 'D2', 'D3']})
dfA

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [13]:
dfB

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [14]:
# Merging on unique keys 
# by default we're doing an inner join

pd.merge(dfA, dfB, on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [16]:
 # Understand the difference between left and right joins
 
dfA = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})

dfB = pd.DataFrame({'key': ['K4', 'K1', 'K2', 'K3'],
                       'C': ['C0', 'C1', 'C2', 'C3'],
                       'D': ['D0', 'D1', 'D2', 'D3']})
 
 pd.merge(dfA, dfB, how='left', on='key')

  key   A   B    C    D
0  K0  A0  B0  NaN  NaN
1  K1  A1  B1   C1   D1
2  K2  A2  B2   C2   D2
3  K3  A3  B3   C3   D3

In [0]:
# Inner Joins

pd.merge(dfA, dfB, how='inner', on='key')

  key   A   B   C   D
0  K1  A1  B1  C1  D1
1  K2  A2  B2  C2  D2
2  K3  A3  B3  C3  D3

In [17]:
# Outer Joins

pd.merge(dfA, dfB, how='outer', on='key')

  key    A    B    C    D
0  K0   A0   B0  NaN  NaN
1  K1   A1   B1   C1   D1
2  K2   A2   B2   C2   D2
3  K3   A3   B3   C3   D3
4  K4  NaN  NaN   C0   D0

# Joining

In [19]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                      'B': ['B0', 'B1', 'B2']},
                     index=['K0', 'K1', 'K2'])

left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [20]:
right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                       'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [21]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [22]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3